tutorials/oneD_freely_propagating_flame/2_model_test/posteriori/oneD_freely_propagating_flame/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     dfLowMachFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.00201;

deltaT          1e-6;

maxDeltaT       1e-04;

adjustTimeStep  off;

writeControl    adjustableRunTime;

writeInterval   0.0001;

purgeWrite      0;

writeFormat     ascii;

// writePrecision    6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// adjustTimeStep yes;

// maxCo  0.8;

// maxDeltaT 1e-4;


// ************************************************************************* //
